configuration/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>АдминистративныеВопросыОбщее</name>
      <description>Административные вопросы</description>
    </items>
    <items>
      <name>АнализТребованийОбщее</name>
      <description>Анализ требований</description>
    </items>
    <items>
      <name>АнализТребованийЗаказчика</name>
      <description>Анализ требований заказчика</description>
    </items>
    <items>
      <name>ИзучениеОбщее</name>
      <description>Изучение</description>
    </items>
    <items>
      <name>ИзучениеТехническойЗадачи</name>
      <description>Изучение технической задачи</description>
    </items>
    <items>
      <name>КонсультацияПользователей</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>КонсультацияПользователейОбщее</name>
      <description>Консультация пользователей</description>
    </items>
    <items>
      <name>ОбсуждениеИзменений</name>
      <description>Обсуждение изменений</description>
    </items>
    <items>
      <name>ПодготовкаАрхитектуры</name>
      <description>Подготовка архитектуры</description>
    </items>
    <items>
      <name>ПодготовкаДокументацииОбщее</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаДокументации</name>
      <description>Подготовка документации</description>
    </items>
    <items>
      <name>ПодготовкаТехническогоЗаданияОбщее</name>
      <description>Подготовка технического задания</description>
    </items>
    <items>
      <name>ПроектированиеОбщее</name>
      <description>Проектирование</description>
    </items>
    <items>
      <name>РеализацияИзменений</name>
      <description>Реализация изменений</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТестированиеОбщее</name>
      <description>Тестирование</description>
    </items>
    <items>
      <name>ТехническиеРаботы</name>
      <description>Технические работы</description>
    </items>
  </predefined>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияВидовДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляСобрания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/НазначенияВидовДеятельности/НазначенияВидовДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияВидовДеятельности</name>
  <enumValues>
    <name>Общее</name>
  </enumValues>
  <enumValues>
    <name>ITПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ВнутренниеТрудозатраты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Услуги/Услуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Услуги</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКвалификации</name>
    <type>
      <types>EnumRef.УровниКвалификацииITДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированныйТариф</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ВидыДеятельности/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ТолстыйКлиент ИЛИ ВнешнееСоединение Тогда
	
#Область ОбъявлениеПеременных

Перем АктуализироватьВидыДеятельностиУслуг;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование, Назначение");
	
	Если НЕ ЭтоНовый() Тогда
		Если Назначение <> СтарыеЗначения.Назначение И Назначение = Перечисления.НазначенияВидовДеятельности.Общее
			И ИспользуетсяВУслуге(Отказ) Тогда
			Возврат;
		КонецЕсли;
		
		АктуализироватьВидыДеятельностиУслуг = (Назначение = Перечисления.НазначенияВидовДеятельности.ITПодразделение
			И СтарыеЗначения.Наименование <> Наименование);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АктуализироватьВидыДеятельностиУслуг = Истина Тогда
		Справочники.ВидыДеятельностиУслуг.ОбработатьИзменениеВидаДеятельности(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИспользуетсяВУслуге(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Услуги.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Услуги.ВидыДеятельности КАК УслугиВидыДеятельности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Услуги КАК Услуги
	|		ПО УслугиВидыДеятельности.Ссылка = Услуги.Ссылка
	|ГДЕ
	|	УслугиВидыДеятельности.ВидДеятельности = &ВидДеятельности
	|	И Услуги.Используется
	|	И НЕ Услуги.ПометкаУдаления";
	Запрос.УстановитьПараметр("ВидДеятельности", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Услуги = Новый Массив;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Услуги.Добавить(Выборка.Наименование);
		КонецЦикла;
		
		Сообщение = СтрШаблон("Общее назначение предназначено для пользователей, которые не относятся к IT.
									|Данный вид деятельности уже используется в услугах: %1.", СтрСоединить(Услуги, ", "));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, , , , Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
